function T = Kinematics(q)
%% Kinematics PUMA560的正解
% 输入：六个关节角
% 输出：末端位姿
%% 参数
d_2=149.09;d_4=433.07;a_2=431.8;a_3=20.32;
%% 正解过程
T10=[cos(q(1)) -sin(q(1)) 0 0;sin(q(1)) cos(q(1)) 0 0;0 0 1 0;0 0 0 1;];
T21=[cos(q(2)) -sin(q(2)) 0 0;0 0 1 d_2;-sin(q(2)) -cos(q(2)) 0 0;0 0 0 1;];
T32=[cos(q(3)) -sin(q(3)) 0 a_2;sin(q(3)) cos(q(3)) 0 0;0 0 1 0;0 0 0 1;];
T43=[cos(q(4)) -sin(q(4)) 0 a_3;0 0 1 d_4;-sin(q(4)) -cos(q(4)) 0 0;0 0 0 1;];
T54=[cos(q(5)) -sin(q(5)) 0 0;0 0 -1 0;sin(q(5)) cos(q(5)) 0 0;0 0 0 1;];
T65=[cos(q(6)) -sin(q(6)) 0 0;0 0 1 0;-sin(q(6)) -cos(q(6)) 0 0;0 0 0 1;];
T=T10*T21*T32*T43*T54*T65;
end

